# Chocolates Data Set With Pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('./Data/Chocolates.csv')
df

,Sales Person,Geography,Product,Date,Amount,Boxes,Unnamed: 6
0,Dennison Crosswaite,UK,Almond Choco,01/01/2021,"$2,037",422,NaN
1,Kelci Walkden,India,Almond Choco,01/01/2021,"$6,160",126,NaN
2,Gigi Bohling,Canada,Caramel Stuffed Bars,01/01/2021,"$1,442",200,NaN
3,Madelene Upcott,India,Eclairs,01/01/2021,"$6,979",252,NaN
4,Oby Sorrel,USA,Manuka Honey Choco,01/01/2021,$966,71,NaN
...,...,...,...,...,...,...,...
9444,Dotty Strutley,Canada,Drinking Coco,14/03/2022,"$3,325",167,NaN
9445,Roddy Speechley,Australia,70% Dark Bites,09/03/2022,"$4,900",205,NaN
9446,Curtice Advani,USA,85% Dark Bars,04/03/2022,"$8,911",388,NaN
9447,Roddy Speechley,UK,70% Dark Bites,24/03/2022,"$1,316",51,NaN
9448,Kaine Padly,Canada,Fruit & Nut Bars,01/03/2022,"$4,340",155,NaN

In [4]:
df.head()

,Sales Person,Geography,Product,Date,Amount,Boxes,Unnamed: 6
0,Dennison Crosswaite,UK,Almond Choco,01/01/2021,"$2,037",422,NaN
1,Kelci Walkden,India,Almond Choco,01/01/2021,"$6,160",126,NaN
2,Gigi Bohling,Canada,Caramel Stuffed Bars,01/01/2021,"$1,442",200,NaN
3,Madelene Upcott,India,Eclairs,01/01/2021,"$6,979",252,NaN
4,Oby Sorrel,USA,Manuka Honey Choco,01/01/2021,$966,71,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9449 entries, 0 to 9448
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sales Person  9449 non-null   object
 1   Geography     9449 non-null   object
 2   Product       9449 non-null   object
 3   Date          9449 non-null   object
 4   Amount        9449 non-null   object
 5   Boxes         9449 non-null   int64
 6   Unnamed: 6    0 non-null      float64
dtypes: float64(1), int64(1), object(5)
memory usage: 516.9+ KB

In [6]:
df.isna().any()

Sales Person    False
Geography       False
Product         False
Date            False
Amount          False
Boxes           False
Unnamed: 6       True
dtype: bool

In [7]:
df["Sales Person"].duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9444     True
9445     True
9446     True
9447     True
9448     True
Name: Sales Person, Length: 9449, dtype: bool

In [8]:
df["Sales Person"].value_counts()

Sales Person
Gunar Cockshoot        453
Andria Kimpton         432
Kelci Walkden          427
Beverie Moffet         427
Rafaelita Blaksland    427
Wilone O'Kielt         425
Brien Boise            425
Jan Morforth           424
Dotty Strutley         424
Ches Bonnell           423
Husein Augar           422
Madelene Upcott        421
Dennison Crosswaite    420
Gigi Bohling           420
Karlen McCaffrey       417
Barr Faughny           416
Oby Sorrel             415
Marney O'Breen         415
Curtice Advani         411
Kaine Padly            393
Van Tuxwell            208
Roddy Speechley        207
Camilla Castle         206
Jehu Rudeforth         200
Mallorie Waber         191
Name: count, dtype: int64

In [9]:
df["Sales Person"].unique()

array(['Dennison Crosswaite', 'Kelci Walkden', 'Gigi Bohling',
       'Madelene Upcott', 'Oby Sorrel', 'Brien Boise', 'Jan Morforth',
       "Marney O'Breen", 'Andria Kimpton', 'Barr Faughny', 'Husein Augar',
       'Ches Bonnell', 'Dotty Strutley', 'Curtice Advani',
       'Rafaelita Blaksland', 'Kaine Padly', 'Beverie Moffet',
       'Karlen McCaffrey', "Wilone O'Kielt", 'Gunar Cockshoot',
       'Van Tuxwell', 'Camilla Castle', 'Mallorie Waber',
       'Jehu Rudeforth', 'Roddy Speechley'], dtype=object)

In [10]:
f"Total Sales person: {len(df["Sales Person"].unique())}"

'Total Sales person: 25'

In [11]:
df["Geography"].head()

0        UK
1     India
2    Canada
3     India
4       USA
Name: Geography, dtype: object

In [12]:
f"Total Geographyical Location: {len(df["Geography"].unique())}"

'Total Geographyical Location: 6'

In [13]:
df.describe()

             Boxes  Unnamed: 6
count  9449.000000         0.0
mean    325.570537         NaN
std     317.250602         NaN
min       0.000000         NaN
25%     112.000000         NaN
50%     240.000000         NaN
75%     435.000000         NaN
max    3360.000000         NaN

In [14]:
df["Amount"].str.replace("$","")

0       2,037
1       6,160
2       1,442
3       6,979
4         966
         ...
9444    3,325
9445    4,900
9446    8,911
9447    1,316
9448    4,340
Name: Amount, Length: 9449, dtype: object

In [15]:
df["Date"] = pd.to_datetime(df["Date"], format = '%d/%m/%Y')
df["Date"].head()

0   2021-01-01
1   2021-01-01
2   2021-01-01
3   2021-01-01
4   2021-01-01
Name: Date, dtype: datetime64[ns]

In [16]:
df["Date"].value_counts()

Date
2022-01-17    79
2021-11-15    78
2022-02-14    73
2022-02-23    71
2021-10-07    71
              ..
2021-05-24     5
2022-03-31     5
2021-05-31     4
2021-06-30     2
2021-06-25     2
Name: count, Length: 325, dtype: int64

In [17]:
df["Date"].dtype

dtype('<M8[ns]')

In [18]:
df["Product"].head()

0            Almond Choco
1            Almond Choco
2    Caramel Stuffed Bars
3                 Eclairs
4      Manuka Honey Choco
Name: Product, dtype: object

In [19]:
df["Product"]

0               Almond Choco
1               Almond Choco
2       Caramel Stuffed Bars
3                    Eclairs
4         Manuka Honey Choco
                ...
9444           Drinking Coco
9445          70% Dark Bites
9446           85% Dark Bars
9447          70% Dark Bites
9448        Fruit & Nut Bars
Name: Product, Length: 9449, dtype: object